myLisp> (the answer is 42)
=> (the.(answer.(is.(42.nil))))

myLisp> (() ())
=> (nil.(nil.nil))

myLisp> (1 . (1 2 3 4))
=> (1.(1.(2.(3.(4.nil)))))

myLisp> (1 . ())
=> (1.nil)

myLisp> ((1 2 3 4) 3 (2))
=> ((1.(2.(3.(4.nil)))).(3.((2.nil).nil)))

myLisp> (1 . (1 2 3 4 . ()))
=> (1.(1.(2.(3.(4.nil)))))

myLisp> ((1 2 3 4) 3 (3 4).())
=> ((1.(2.(3.(4.nil)))).(3.((3.(4.nil)).nil)))

myLisp> (1 2 3 4 . ())
=> (1.(2.(3.(4.nil))))

myLisp> (1 a A . (1 a A . A))
=> (1.(a.(A.(1.(a.(A.A))))))
